tareas/app/Controllers/tasks.php

    public function store()
    {
        $session = session();
        $model = new TareaModel();

        $data = [
            'titulo' => $this->request->getPost('titulo'),
            'descripcion' => $this->request->getPost('descripcion'),
            'fecha_vencimiento' => $this->request->getPost('fecha_vencimiento'),
            'estado' => $this->request->getPost('estado'),
            'usuario_id' => $session->get('user_id'),
        ];

        if ($model->insert($data)) {
---
INSERT INTO `tareas` (`titulo`, `descripcion`, `fecha_vencimiento`, `estado`, `usuario_id`) VALUES ('Jackie chan', 'ir a comer parrillada', '2024-08-03', 'Pendiente', '2')

    public function edit($id)
    {
        $model = new TareaModel();
        $data['task'] = $model->find($id);
---
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '2'