tareas/app/Controllers/Users.php

    public function index()
{
    $session = session();
    $userId = $session->get('user_id');

    if (!$userId) {
        return redirect()->to('/users/iniciar');
    }

    $model = new TareaModel();
    $data['tasks'] = $model->where('usuario_id', $userId)->findAll();
---
SELECT *
FROM `tareas`
WHERE `usuario_id` = '2'

    public function login()
    {
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getVar('name');
        $password = $this->request->getVar('password');

        $user = $userModel->where('nombre_usuario', $username)->first();
---
SELECT *
FROM `usuarios`
WHERE `nombre_usuario` = 'jane_smith'
 LIMIT 1